* 1.2.3
	Core Idea - Better output support and results controls

** Column View
  - Fixed a small regression introduced in plists in some of the earlier babel work.
    This was impacting columnview

** Test File
  To help new users we now have an:

  "Org Show Testfile" command that will quickly create a testfile for a user to play with.
** Babel Preview Output Handlers
  List Handler

   #+BEGIN_SRC python :results list
     print(str([1,2,3,4,5]))
   #+END_SRC

   #+RESULTS:
   - 1
   - 2
   - 3
   - 4
   - 5

   File Handler With a List
   
   #+BEGIN_SRC python :results list :file out.py
     print(str([1,2,3,4,5]))
   #+END_SRC

   #+RESULTS:
   [[file:out.py]] 


** Babel Preview Output Formatting
  These wrap the output in a formatting block of some sort.

*** Drawer Formatter
   will wrap output in a drawer

   #+BEGIN_SRC python :results drawer verbatim:var x=5
     print("Hello World")
     print(x)
   #+END_SRC

   #+RESULTS:
    :results:
    Hello World
    5
    :end:

*** Code Formatter
    will generate a code block with the output:

   #+BEGIN_SRC python :results code
     print(str([1,2,3,4,5]))
   #+END_SRC

   #+RESULTS:
    #+begin_src python
    [1, 2, 3, 4, 5]
    #+end_src

*** Org Mode Formatter
    will generate a code block specific to org

   #+BEGIN_SRC python :results org
     print("#+COMMENT: org data here")
   #+END_SRC

   #+RESULTS:
    #+begin_src org
    #+COMMENT: org data here
    #+end_src

*** Append Prepend Silent Replace

   #+BEGIN_SRC python :results org append
     print("#+COMMENT: org data here")
   #+END_SRC

   #+RESULTS:
    #+begin_src org
    #+COMMENT: org data here
    #+end_src
    #+begin_src org
    #+COMMENT: org data here
    #+end_src
    #+begin_src org
    #+COMMENT: org data here
    #+end_src
   

   #+BEGIN_SRC python :results org prepend
     print("#+COMMENT: org data here")
   #+END_SRC

   #+RESULTS:
    #+begin_src org
    #+COMMENT: org data here
    #+end_src
    #+begin_src org
    #+COMMENT: org data here
    #+end_src
    #+begin_src org
    #+COMMENT: org data here
    #+end_src
   
   #+BEGIN_SRC python :results org silent
     print("#+COMMENT: org data here")
   #+END_SRC

    #+RESULTS:
